{
  "Name": "Hazard 6",
  "Description": "Base preset for Ike's [Hazard 6](https://drg.mod.io/ike) mod. Read below for more in-depth customizability options. Unlike the original Hazard 6 mod, there are some differences in this preset:\n- The resupply pod cost is set to 80 Nitra compared to the original Hazard 6's 60 Nitra cost.\n- The Hazard bonus is set to the default Hazard 5 bonus of 133% rather than the original Hazard 6's 166% (this is an intended limitation of the Custom Difficulty mod).\n\nOtherwise, other settings are still the same as the original Hazard 6 mod: the Hazard 6 enemy, swarm, etc... stats, vanilla spawn cap of 60/60 swarmers and enemies, and increased Doretta resistance.\n\n## Recommended Customizable Settings\nThese are the recommended settings to balance accordingly. Simply copy-paste this base preset file into the mod, then change the settings accordingly (or leave as-is if you don't want to customize anything).\n\n### \"EnemyCountModifier\"\nThese are the values for \"EnemyCountModifier\" for the respective increased enemy multiplier variants if you wanted to increase enemy count. If you want to set your own multiplier variant that is not on the following list, these values are derived by simply multiplying the default Hazard 6's EnemyCountModifier values (0.95, 1.05, 1.35, 1.65) by that multiplier.\n* Hazard 6, 1.25x Enemies - `\"EnemyCountModifier\": [1.1875, 1.3125, 1.6875, 2.0625]`\n* Hazard 6, 1.5x Enemies - `\"EnemyCountModifier\": [1.425, 1.575, 2.025, 2.475]`\n* Hazard 6, 1.75x Enemies - `\"EnemyCountModifier\": [1.6625, 1.8375, 2.3625, 2.8875]`\n* Hazard 6, 2x Enemies - since this is the most popular variant of Hazard 6, there is already a built \"[Hazard 6x2](https://github.com/Pugglez/drg-custom-difficulties#hazard-6x2)\" preset that you can start from instead.\n\n### \"ResupplyCost\"\nThis setting controls how much nitra it costs to call a resupply pod.\n* *For regular Hazard 6* -  60 to 80 Nitra are the recommended settings. Although the original Hazard 6 mod has it set to 60 Nitra, Hazard 6 is still easily and consistently doable with the vanilla default of 80 Nitra.\n* *For Hazard 6, increased enemy count (1.25x, 1.5x, 1.75x, 2x,)* - 40 to 60 Nitra are the recommended settings.\n    * 60 Nitra is still consistently possible to do even with Hazard 6x2. The reason why the recommended range is between 40 to 60 Nitra is because certain factors (nitra generation and overall spawns RNG) can make getting the first 1-2 resupplies very difficulty and on really bad RNG missions, you can suffer nitra starvation even with a good/efficient team.\n        * For <2x enemy count, you can go down to 50 Nitra instead of 40 as the lower end.\n        *  For Hazard 6x2 and above, 40 Nitra is recommended for a more consistent RNG-less affected experience (although as mentioned above, 60 Nitra is still consistently possible to do with Haz6x2).\n        * You might encounter some missions, especially the short/easier missions and Salvage missions in particular, where you have excessive amounts of nitra due to the reduced nitra cost. At this point, it is up to you and your team on restraining yourselves from abusing the excess nitra to balance the difficulty.\n\n### \"MaxActiveSwarmers\" and \"MaxActiveEnemies\"\nThese settings controls the maximum amount of swarmers and enemies, respectively, that can be present in the mission at any given time. In vanilla DRG, this is set to 60 swarmers and 60 enemies which means there can be a max total of 120 combined enemies.\n\nAdditionally, the mod allows you to control this cap to be player-count dependent (i.e., `\"MaxActiveEnemies\": [100, 180, 180, 180]` means the cap is set to 100/180/180/180 enemies for 1/2/3/4 players in the lobby, respectively). Note you can set this to either be an *array of numbers* (like the given example above) or simply a number (i.e., `\"MaxActiveEnemies\": 180` which is equivalent to `\"MaxActiveEnemies\": [180, 180, 180, 180]`).\n\n* For simplicity's sake, **just set both MaxActiveSwarmers and MaxActiveEnemies to the same value.**\n* For *regular Hazard 6* - Your personal choice. By default, this preset sets it to vanilla DRG's 60 cap across all player count. Do note that even in regular Hazard 5, it is very easy to hit the vanilla spawn cap. So if you want to increase the difficulty, you do want to increase spawn cap.\n    * If you're unsure, either leave it as is or follow the same recommended spawn cap for increased enemy count below.\n* For *regular Hazard 6, increased enemy count (1.25x, 1.5x, 1.75x, 2x,)* - the recommended settings are `[100, 180, 180, 180]` for 1/2/3/4 players respectively.\n    * You can certainly choose to go for a higher cap for each value. However, be aware that FPS performance issues can start to creep in for the players. Also, specifically for solo cap, there is the problem of \"wandering enemies\" that increases which can be hard to recover from in solo\n        * For more in-depth information of this \"wandering enemies\" problem, read: https://hackmd.io/@rryq0f4CQVC6CMGbnXR4YA/r11B8PdHq\n    * Of course, to decrease difficulty, then lower the enemy spawn cap.\n\n### \"SeasonalEvents\"\nScroll down; this setting is near the bottom of the preset. These settings control which of the seasonal events are allowed to spawn in the mission. In this preset, all seasonal events are enabled. *If you want to prevent a certain event from spawning, simply delete that corresponding line in this setting.*\n* For *regular Hazard 6* - Your personal choice. Essentially the question here is if you want to enable or disable the Prospector enemy event (`SE_ProspectorDrone`) specifically, because it is this specific event that is easily triggerable by accident. The other seasonal events (Data Deposit and Rival Router), you can simply choose to not to start if you come across them. Prospector is still consistently doable even for an average team in regular Hazard 6, hence why it is still enabled by default for this preset.\n* For *regular Hazard 6, increased enemy count (1.25x, 1.5x, 1.75x, 2x,)* - I recommend disabling the Prospector enemy event (`SE_ProspectorDrone`). Chasing the Prospector and dealing with the increased count of robots and enemies makes this event very hard to do, even for very experienced increased enemy count Hazard 6 players.\n    * That's not to say the Prospector is impossible in these increased enemy count variants, it's definitely beatable even in Hazard 6x2 with the correct strategies. It's just that with the chaos of more enemies, the Prospector can be easily woken up by accident which may result in undesirable consequences.",
  "MaxActiveSwarmers": [
    60,
    60,
    60,
    60
  ],
  "MaxActiveEnemies": [
    60,
    60,
    60,
    60
  ],
  "ResupplyCost": 80,
  "ExtraLargeEnemyDamageResistance": [
    1,
    1.3,
    1.7,
    2.1
  ],
  "ExtraLargeEnemyDamageResistanceB": [
    1,
    1.3,
    1.5,
    1.7
  ],
  "ExtraLargeEnemyDamageResistanceC": [
    1,
    1.3,
    1.7,
    2.1
  ],
  "ExtraLargeEnemyDamageResistanceD": [
    1.5,
    1.55,
    1.75,
    1.9
  ],
  "EnemyDamageResistance": [
    1.4,
    1.5,
    1.6,
    1.75
  ],
  "EnemyDamageModifier": [
    3.3,
    3.65,
    3.9,
    4.1
  ],
  "EnemyCountModifier": [
    0.95,
    1.05,
    1.35,
    1.65
  ],
  "EncounterDifficulty": [
    {
      "weight": 1,
      "range": {
        "min": 550,
        "max": 650
      }
    },
    {
      "weight": 6,
      "range": {
        "min": 450,
        "max": 750
      }
    },
    {
      "weight": 1,
      "range": {
        "min": 550,
        "max": 650
      }
    }
  ],
  "StationaryDifficulty": [
    {
      "weight": 0,
      "range": {
        "min": 0,
        "max": 0
      }
    },
    {
      "weight": 1,
      "range": {
        "min": 350,
        "max": 450
      }
    },
    {
      "weight": 0,
      "range": {
        "min": 250,
        "max": 350
      }
    }
  ],
  "EnemyWaveInterval": [
    {
      "weight": 0,
      "range": {
        "min": 160,
        "max": 180
      }
    },
    {
      "weight": 7.5,
      "range": {
        "min": 125,
        "max": 165
      }
    },
    {
      "weight": 0,
      "range": {
        "min": 299,
        "max": 299
      }
    }
  ],
  "EnemyNormalWaveInterval": [
    {
      "weight": 4,
      "range": {
        "min": 170,
        "max": 210
      }
    },
    {
      "weight": 2,
      "range": {
        "min": 180,
        "max": 190
      }
    }
  ],
  "EnemyNormalWaveDifficulty": [
    {
      "weight": 1,
      "range": {
        "min": 550,
        "max": 650
      }
    }
  ],
  "EnemyDiversity": [
    {
      "weight": 2,
      "range": {
        "min": 4,
        "max": 2
      }
    },
    {
      "weight": 8,
      "range": {
        "min": 6,
        "max": 4
      }
    },
    {
      "weight": 0,
      "range": {
        "min": 5,
        "max": 6
      }
    }
  ],
  "StationaryEnemyDiversity": [
    {
      "weight": 1,
      "range": {
        "min": 4,
        "max": 4
      }
    }
  ],
  "VeteranNormal": [
    {
      "weight": 2,
      "range": {
        "min": 0,
        "max": 0
      }
    },
    {
      "weight": 0,
      "range": {
        "min": 0.6,
        "max": 0.7
      }
    },
    {
      "weight": 2,
      "range": {
        "min": 0.5,
        "max": 0.8
      }
    },
    {
      "weight": 0,
      "range": {
        "min": 1,
        "max": 1
      }
    }
  ],
  "VeteranLarge": [
    {
      "weight": 1,
      "range": {
        "min": 0.2,
        "max": 0.2
      }
    }
  ],
  "DisruptiveEnemyPoolCount": {
    "min": 4,
    "max": 6
  },
  "MinPoolSize": 12,
  "EnvironmentalDamageModifier": 1.4,
  "PointExtractionScalar": 1.4,
  "FriendlyFireModifier": 0.9,
  "SpeedModifier": 1.25,
  "AttackCooldownModifier": 1.75,
  "ProjectileSpeedModifier": 1.9,
  "EscortMule": {
    "FriendlyFireModifier": 0.1,
    "BigHitDamageModifier": 0.75,
    "BigHitDamageReductionThreshold": 0,
    "NeutralDamageModifier": 0.1
  }
}